tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
/*
 * Copyright 2021-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_netc_endpoint.h"
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
#include "fsl_netc_timer.h"
#endif
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051587) && FSL_FEATURE_NETC_HAS_ERRATA_051587
#include "fsl_netc_timer.h"
#include <math.h>
#endif

/*! @name Defines some Ethernet parameters. */
/*@{*/
#define NETC_ENETC_TXFRAME_LEN_MAX     (9600U)        /*!< The Maximum length of frame length. */
#define NETC_ENETC_TXFRAME_LEN_MIN     (16U)          /*!< The Minimum length of frame length. */
/*@}*/

/*! @brief Mask the cache management code if cache control is disabled. */
#if !defined(FSL_ETH_ENABLE_CACHE_CONTROL)
#define NETC_DcacheInvalidateByRange(address, sizeByte)
#define NETC_DcacheCleanByRange(address, sizeByte)
#else
#define NETC_DcacheInvalidateByRange(address, sizeByte) DCACHE_InvalidateByRange(address, sizeByte)
#define NETC_DcacheCleanByRange(address, sizeByte)      DCACHE_CleanByRange(address, sizeByte)
#endif

/*! @brief Command BD common buffer. */
AT_NONCACHEABLE_SECTION_ALIGN(static netc_tb_data_buffer_t s_cmdData, 16);

/*!
 * @brief Get register map resource for handle
 *
 * @param handle  The EP handle.
 * @param si      The SI object.
 */
static void EP_GetBaseResource(ep_handle_t *handle, netc_hw_si_idx_t si)
{
    NETC_SocGetBaseResource(&handle->hw, si);
}

/*!
 * @brief Store necessary configuration constant in the handle
 *
 * @param handle  The EP handle.
 * @param config  The user configuration.
 */
static void EP_StoreConfig(ep_handle_t *handle, const ep_config_t *config)
{
    handle->cfg.si              = config->si;
    handle->cfg.rxRingUse       = config->siConfig.rxRingUse;
    handle->cfg.txRingUse       = config->siConfig.txRingUse;
    handle->cfg.rxBdrGroupNum   = config->siConfig.rxBdrGroupNum;
    handle->cfg.ringPerBdrGroup = config->siConfig.ringPerBdrGroup;
    handle->cfg.entryNum        = config->entryNum;
    handle->cfg.reclaimCallback = config->reclaimCallback;
    handle->cfg.userData        = config->userData;
    handle->cfg.rxCacheMaintain = config->rxCacheMaintain;
    handle->cfg.txCacheMaintain = config->txCacheMaintain;
    handle->cfg.rxZeroCopy      = config->rxZeroCopy;
    handle->cfg.rxBuffAlloc     = config->rxBuffAlloc;
    handle->cfg.rxBuffFree      = config->rxBuffFree;
}

/*!
 * @brief Free all Rx buffers
 *
 * @param handle  The EP handle.
 */
static void EP_RxBufferFreeAll(ep_handle_t *handle)
{
    netc_rx_bdr_t *rxBdRing;
    uint32_t maxHwBdNum;
    uint32_t index;
    uint8_t ring;

    if (handle->cfg.rxZeroCopy)
    {
        for (ring = 0U; ring < handle->cfg.rxRingUse; ring++)
        {
            rxBdRing = &handle->rxBdRing[ring];
            /* Hardware BD number means actual BD number in hardware view, two standard BDs act as one extended BD. */
            maxHwBdNum = rxBdRing->extendDesc ? (rxBdRing->len / 2U) : rxBdRing->len;

            for (index = 0U; index < maxHwBdNum; index++)
            {
                if (rxBdRing->buffArray[index] != 0U)
                {
                    handle->cfg.rxBuffFree(handle, ring, (void *)(uint8_t *)(uintptr_t)rxBdRing->buffArray[index],
                                           handle->cfg.userData);
                }
            }
        }
    }
}

/*!
 * @brief Allocate Rx buffers for Rx BD rings
 *
 * @param handle     The EP handle.
 * @param config     The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_RxBufferAllocAll(ep_handle_t *handle, const ep_config_t *config, const netc_bdr_config_t *bdrConfig)
{
    status_t result = kStatus_Success;
    const netc_rx_bdr_config_t *rxRingConfig;
    netc_rx_bd_t *rxDesc;
    uint64_t buffAddr;
    uint16_t buffIdx;
    uint16_t index;
    uint8_t ring;

    for (ring = 0U; ring < config->siConfig.rxRingUse; ring++)
    {
        rxRingConfig = &bdrConfig->rxBdrConfig[ring];
        rxDesc       = &rxRingConfig->bdArray[0];

        /* Store address information in the array in case the buffer address is lost due to Rx BD write-back. */
        handle->rxBdRing[ring].buffArray = rxRingConfig->buffAddrArray;

        /* Initialize the buffers in Rx BD ring. */
        for (index = 0U; index < rxRingConfig->len; index++)
        {
            /* Clear Rx BD before config the receive buffer start address */
            (void)memset(rxDesc, 0, sizeof(netc_rx_bd_t));

            /* When extended BD is enabled, two standard BDs represet one extended BD. Even number BD sets 0. */
            if (rxRingConfig->extendDescEn && (index % 2U != 0U))
            {
                rxDesc++;
                continue;
            }

            buffIdx = rxRingConfig->extendDescEn ? (index / 2U) : index;
            if (!config->rxZeroCopy)
            {
                /* Get Rx buffer address from the address array provided by application. */
                buffAddr = handle->rxBdRing[ring].buffArray[buffIdx];
            }
            else
            {
                /* Get Rx buffer address from the allocation function provided by application. */
                buffAddr = (uint64_t)(uintptr_t)(uint8_t *)handle->cfg.rxBuffAlloc(
                    handle, ring, handle->rxBdRing[ring].buffSize, handle->cfg.userData);
                if (buffAddr == 0U)
                {
                    EP_RxBufferFreeAll(handle);
                    result = kStatus_NETC_LackOfResource;
                    break;
                }

                /* Keep Rx buffer address from pool in driver until it's freed. */
                handle->rxBdRing[ring].buffArray[buffIdx] = buffAddr;
            }

#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            buffAddr = MEMORY_ConvertMemoryMapAddress((uintptr_t)buffAddr, kMEMORY_Local2DMA);
#endif
            rxDesc->standard.addr = buffAddr;
            rxDesc++;
        }

        if (result != kStatus_Success)
        {
            break;
        }
    }

    return result;
}

/*!
 * @brief Initialize the Tx/Rx BD ring
 *
 * @param handle     The EP handle.
 * @param config     The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_DescriptorInit(ep_handle_t *handle, const ep_config_t *config, const netc_bdr_config_t *bdrConfig)
{
    assert(bdrConfig != NULL);

    status_t result  = kStatus_Success;
    uint8_t ring;

