tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    /* Setup Tx/Rx buffer descriptor rings. */
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* For management ENETC, the SI 0 hardware Tx ring index 0 has been keep for direct switch enqueue feature */
        handle->ringShift = 1;
    }
    else
#endif
    {
        handle->ringShift = 0;
    }

    for (ring = 0; ring < config->siConfig.txRingUse; ring++)
    {
        if (NETC_SIConfigTxBDR(handle->hw.si, ring + handle->ringShift, &bdrConfig->txBdrConfig[ring]) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->txBdRing[ring].bdBase    = bdrConfig->txBdrConfig[ring].bdArray;
        handle->txBdRing[ring].dirtyBase = bdrConfig->txBdrConfig[ring].dirtyArray;
        handle->txBdRing[ring].len       = bdrConfig->txBdrConfig[ring].len;
    }
    for (ring = 0; ring < config->siConfig.rxRingUse; ring++)
    {
        if (NETC_SIConfigRxBDR(handle->hw.si, ring, &bdrConfig->rxBdrConfig[ring]) != kStatus_Success)
        {
            return kStatus_Fail;
        }
        handle->rxBdRing[ring].extendDesc = bdrConfig->rxBdrConfig[ring].extendDescEn;
        handle->rxBdRing[ring].bdBase     = bdrConfig->rxBdrConfig[ring].bdArray;
        handle->rxBdRing[ring].len        = bdrConfig->rxBdrConfig[ring].len;
        handle->rxBdRing[ring].buffSize   = bdrConfig->rxBdrConfig[ring].buffSize;
    }

    /* Allocate Rx buffers to the BDs. */
    result = EP_RxBufferAllocAll(handle, config, bdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Enable the used BD ring. */
    for (ring = 0; ring < config->siConfig.rxRingUse; ring++)
    {
        NETC_SIRxRingEnable(handle->hw.si, ring, true);
    }

    return kStatus_Success;
}

/*!
 * @brief Setup Station Interface
 *
 * @param handle     The EP handle.
 * @param si         The SI number.
 * @param epConfig   The EP configuration.
 * @param bdrConfig  The BD ring configuration.
 */
static status_t EP_SISetup(ep_handle_t *handle,
                           uint8_t si,
                           const ep_config_t *epConfig,
                           const netc_bdr_config_t *bdrConfig)
{
    status_t result;

    if (((epConfig->siConfig.ringPerBdrGroup * epConfig->siConfig.rxBdrGroupNum) > epConfig->siConfig.rxRingUse) ||
        (((uint8_t)epConfig->siConfig.defaultRxBdrGroup >= epConfig->siConfig.rxBdrGroupNum) &&
         (epConfig->siConfig.defaultRxBdrGroup != kNETC_SiBDRGroupOne)) ||
        (epConfig->siConfig.ringPerBdrGroup == 0U))
    {
        /* Not recommended to make groups use more rings than the total number available, and Can't selected non
         * existing group */
        return kStatus_InvalidArgument;
    }

    NETC_SISetRxBDRGroup(handle->hw.si, (uint8_t)epConfig->siConfig.rxBdrGroupNum,
                         (uint8_t)epConfig->siConfig.ringPerBdrGroup);
    NETC_SISetDefaultRxBDRGroup(handle->hw.si, epConfig->siConfig.defaultRxBdrGroup);

    /* Configure station interface. */
    result = NETC_EnetcConfigureSI(handle->hw.base, si, &epConfig->siConfig);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* Initialize the Tx/Rx buffer descriptor. */
    result = EP_DescriptorInit(handle, epConfig, bdrConfig);
    if (result != kStatus_Success)
    {
        return result;
    }
    NETC_SIEnableVlanToIpv(handle->hw.si, (bool)epConfig->siConfig.valnToIpvEnable);
    for (uint8_t i = 0U; i < 16U; i++)
    {
        if (epConfig->siConfig.vlanToIpvMap[i] > 7U)
        {
            /* The mapped IPV value range in 0 ~ 7 */
            return kStatus_InvalidArgument;
        }
        else
        {
            NETC_SIMapVlanToIpv(handle->hw.si, i, epConfig->siConfig.vlanToIpvMap[i]);
        }
    }
    for (uint8_t i = 0U; i < 8U; i++)
    {
        if ((epConfig->siConfig.ipvToRingMap[i] != 0U) &&
            (epConfig->siConfig.ipvToRingMap[i] >= epConfig->siConfig.ringPerBdrGroup))
        {
            /* The mapped BD ring should be located in one BD ring group */
            return kStatus_InvalidArgument;
        }
        else
        {
            NETC_SIMapIpvToRing(handle->hw.si, i, epConfig->siConfig.ipvToRingMap[i]);
        }
    }

    /* Enable station interface from both ENETC and SI sides. */
    NETC_EnetcEnableSI(handle->hw.base, si, true);
    NETC_SIEnable(handle->hw.si, true);

    return result;
}

/*!
 * @brief Set the MSIX entry table
 *
 * This function is to set entry table in specified MSIX Table memory. After entry table setup, set interrupts
 * vector/entry index.
 *
 * @param handle  The EP handle.
 * @param config  The EP configuration.
 * @return status_t
 */
static status_t EP_MSIXSetEntryTable(ep_handle_t *handle, const ep_config_t *config)
{
    uint32_t *msixTable  = (uint32_t *)(uintptr_t)handle->hw.msixTable;
    uint32_t *entryTable = (uint32_t *)(uintptr_t)config->msixEntry;
    uint8_t siNum        = getSiNum(handle->cfg.si);
    uint8_t msixNum;
    status_t result;

    result = NETC_EnetcSetMsixEntryNum(handle->hw.base, siNum, config->entryNum);
    if (result != kStatus_Success)
    {
        return result;
    }

    msixNum =
        (uint8_t)(((handle->hw.si->SIPCAPR1 & ENETC_SI_SIPCAPR1_NUM_MSIX_MASK) >> ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT) +
                  1U);

    /* Entry > 0, enable MSIX. */
    if (config->entryNum != 0U)
    {
        if (config->entryNum > msixNum)
        {
            return kStatus_InvalidArgument;
        }

        if (MAX(MAX(config->siComEntryIdx, config->timerSyncEntryIdx), config->cmdBdEntryIdx) >= config->entryNum)
        {
            return kStatus_InvalidArgument;
        }

        /* Use 32-bit access to set MSIX table. */
        for (uint32_t i = 0; i < config->entryNum; i++)
        {
            msixTable[i * 4U]      = entryTable[i * 4U];
            msixTable[i * 4U + 1U] = entryTable[i * 4U + 1U];
            msixTable[i * 4U + 2U] = entryTable[i * 4U + 2U];
            msixTable[i * 4U + 3U] = entryTable[i * 4U + 3U];
        }

