tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
        /* Enable MSIX. */
        if (siNum == 0U)
        {
            handle->hw.func.pf->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK;
        }
        else
        {
            handle->hw.func.vf->PCI_CFC_MSIX_MSG_CTL = ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK;
        }

        /* Set the MSIX table entry index for various events */
        if (handle->capability.vsiNum > 0U)
        {
            handle->hw.si->SIMSIVR = (uint32_t)config->siComEntryIdx & ENETC_SI_SIMSIVR_VECTOR_MASK;
        }
        handle->hw.si->SITMRMSIVR = (uint32_t)config->timerSyncEntryIdx & ENETC_SI_SITMRMSIVR_VECTOR_MASK;
        handle->hw.si->SICMSIVR   = (uint32_t)config->cmdBdEntryIdx & ENETC_SI_SICMSIVR_VECTOR_MASK;
    }
    else
    {
        /* Disable MSIX. */
        if (siNum == 0U)
        {
            handle->hw.func.pf->PCI_CFC_MSIX_MSG_CTL = ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
        }
        else
        {
            handle->hw.func.vf->PCI_CFC_MSIX_MSG_CTL = ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
        }
    }

    return kStatus_Success;
}

/*!
 * @brief Get the idle Tx BD number in the ring
 * @note The last BD before producer index should be treated as an used BD according to hardware design.
 *
 * @param txBdRing  The EP handle.
 * @return The idle BD number.
 */
static uint16_t EP_GetIdleTxBDNum(netc_tx_bdr_t *txBdRing)
{
    if (txBdRing->producerIndex >= txBdRing->cleanIndex)
    {
        return (uint16_t)((txBdRing->len - txBdRing->producerIndex) + txBdRing->cleanIndex - 1U);
    }
    else
    {
        return (txBdRing->cleanIndex - txBdRing->producerIndex - 1U);
    }
}

status_t EP_GetDefaultConfig(ep_config_t *config)
{
    assert(config != NULL);

    (void)memset(config, 0, sizeof(ep_config_t));

    config->port.common.acceptTpid.innerMask = (uint8_t)kNETC_OuterStanCvlan | (uint8_t)kNETC_OuterStanSvlan;
    config->port.common.acceptTpid.outerMask = (uint8_t)kNETC_InnerStanCvlan | (uint8_t)kNETC_InnerStanSvlan;
    config->port.common.pSpeed               = 0x63U;
    config->port.common.rxTsSelect           = kNETC_SyncTime;
#if (defined(FSL_FEATURE_NETC_HAS_PORT_FCSEA) && FSL_FEATURE_NETC_HAS_PORT_FCSEA)
    config->port.common.stompFcs = true;
#endif
    config->port.common.rxPpduBco                        = 20U;
    config->port.common.txPpduBco                        = 20U;
    config->port.common.timeGate.holdSkew                = 64;
    config->port.common.parser.l2PloadCount              = 24;
    config->port.common.parser.l3PayloadCount            = 24;
    config->port.common.parser.enableL3Parser            = true;
    config->port.common.parser.l4PayloadCount            = 24;
    config->port.common.parser.enableL4Parser            = true;
    config->port.ethMac.enableRevMii                     = false;
    config->port.ethMac.txTsSelect                       = kNETC_SyncTime;
    config->port.ethMac.enTxPad                          = true;
    config->port.ethMac.rxMinFrameSize                   = 64U;
    config->port.ethMac.rxMaxFrameSize                   = 0x600U;
    config->port.ethMac.maxBackPressOn                   = 3036U;
    config->port.ethMac.minBackPressOff                  = 20U;
    config->port.ethMac.PreemptionConfig.preemptMode     = kNETC_PreemptDisable;
    config->port.ethMac.PreemptionConfig.enMergeVerify   = false;
    config->port.ethMac.PreemptionConfig.mergeVerifyTime = 10U;
    config->port.ethMac.PreemptionConfig.raf_size        = kNETC_RafSize64;
    config->port.enPseudoMacTxPad                        = true;
    config->psfpCfg.isiPortConfig.defaultISEID           = 0xFFFFU;
    config->siConfig.ringPerBdrGroup                     = 0x1U;
    for (uint8_t i = 0U; i < 8U; i++)
    {
        config->txTcCfg[i].enTcGate           = true;
        config->txTcCfg[i].sduCfg.maxSduSized = 0x600U;
        config->txTcCfg[i].sduCfg.sduType     = kNETC_MPDU;
        config->txPrioToTC[i]                 = i;
        config->siConfig.vsiTcToTC[i]         = i;
    }

    return kStatus_Success;
}

status_t EP_Init(ep_handle_t *handle, uint8_t *macAddr, const ep_config_t *config, const netc_bdr_config_t *bdrConfig)
{
    assert(handle != NULL);
    assert(config != NULL);

    uint8_t siNum = getSiNum(config->si);
    status_t result;
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
    NETC_PORT_Type *swPseudoPort = (NETC_PORT_Type *)FSL_FEATURE_NETC_SWITCH_PSEUDO_PORT_BASE;
    uint32_t porTemp             = 0U;
#endif

    (void)memset(handle, 0, sizeof(ep_handle_t));

    /* Get the register map resource for ENETC */
    EP_GetBaseResource(handle, config->si);

    /* Store necessary configuration constant in the handle */
    EP_StoreConfig(handle, config);

    if (siNum != 0U)
    {
        /* Reset VF function */
        handle->hw.func.vf->PCI_CFC_PCIE_DEV_CTL |= ENETC_VF_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK;
        while ((handle->hw.func.pf->PCI_CFC_PCIE_DEV_CTL & ENETC_VF_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK) != 0U)
        {
        }
        /* Enable master bus and memory access for PCIe and MSI-X */
        handle->hw.func.vf->PCI_CFH_CMD |= ENETC_VF_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK;

        NETC_EnetcGetCapability(handle->hw.base, &handle->capability);
        /* Transmit priority to traffic class mapping */
        handle->hw.base->NUM_SI[siNum].PSICFGR1 = NETC_ENETC_PSICFGR1_TC7_MAP(config->siConfig.vsiTcToTC[7]) |
                                                  NETC_ENETC_PSICFGR1_TC6_MAP(config->siConfig.vsiTcToTC[6]) |
                                                  NETC_ENETC_PSICFGR1_TC5_MAP(config->siConfig.vsiTcToTC[5]) |
                                                  NETC_ENETC_PSICFGR1_TC4_MAP(config->siConfig.vsiTcToTC[4]) |
                                                  NETC_ENETC_PSICFGR1_TC3_MAP(config->siConfig.vsiTcToTC[3]) |
                                                  NETC_ENETC_PSICFGR1_TC2_MAP(config->siConfig.vsiTcToTC[2]) |
                                                  NETC_ENETC_PSICFGR1_TC1_MAP(config->siConfig.vsiTcToTC[1]) |
                                                  NETC_ENETC_PSICFGR1_TC0_MAP(config->siConfig.vsiTcToTC[0]);
    }
    else
    {
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051260) && FSL_FEATURE_NETC_HAS_ERRATA_051260)
        /* Errata 051260: All NETC functions need to be enabled for ENETC NTMP operation */
        SWITCH_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK;
        ENETC0_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK;
        ENETC1_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK;
#endif
        /* Enable master bus and memory access for PCIe and MSI-X */
        handle->hw.func.pf->PCI_CFH_CMD |=
            (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);

        if (!NETC_PortIsPseudo(handle->hw.portGroup.port))
        {
            handle->hw.portGroup.port->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
            /* Do software reset first */
            NETC_PortSoftwareResetEthMac(handle->hw.portGroup.eth);
        }
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
        else
        {
            if (0U != (SWITCH_PCI_HDR_TYPE0->PCI_CFH_CMD & ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK))
            {
                porTemp = swPseudoPort->POR;
                /* Disable the internal switch port's Tx/Rx to prevent frames from flowing into the internal ENETC
                 * during its FLR and bring up */
                swPseudoPort->POR |= (NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
            }
        }
#endif
        /* Reset PF function */
        handle->hw.func.pf->PCI_CFC_PCIE_DEV_CTL |= ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK;
        while ((handle->hw.func.pf->PCI_CFC_PCIE_DEV_CTL & ENETC_PCI_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK) != 0U)
        {
        }

        /* Enable master bus and memory access for PCIe and MSI-X */
        handle->hw.func.pf->PCI_CFH_CMD |=
            (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);

        /* TODO: Here enable virtaul fucntion as default, may need flexible way. */
        /* Enable virtual function */
        handle->hw.func.pf->PCIE_CFC_SRIOV_CTL |=
            (ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_MSE_MASK | ENETC_PCI_TYPE0_PCIE_CFC_SRIOV_CTL_VF_ENABLE_MASK);

        NETC_EnetcGetCapability(handle->hw.base, &handle->capability);

        /* Only PSI needs to configure port */
        result = NETC_PortConfig(handle->hw.portGroup.port, &config->port.common);
        if (result != kStatus_Success)
        {
            return result;
        }

        if (!NETC_PortIsPseudo(handle->hw.portGroup.port))
        {
            result = NETC_PortConfigEthMac(handle->hw.portGroup.eth, &config->port.ethMac);
            if (result != kStatus_Success)
            {
                return result;
            }
        }
#if !(defined(FSL_FEATURE_NETC_HAS_NO_SWITCH) && FSL_FEATURE_NETC_HAS_NO_SWITCH)
        else
        {
            handle->hw.portGroup.pseudo->PPMCR = NETC_PSEUDO_LINK_PPMCR_TXPAD(config->port.enPseudoMacTxPad);
        }
#endif
        /* Configure Port VLAN classification control, only do PSI */
        handle->hw.base->PVCLCTR = NETC_ENETC_PVCLCTR_OAI(config->enOuterAsInner);
        /* Configure ENETC pasue on/off threshold, only do PSI */
        handle->hw.base->PPAUONTR  = NETC_ENETC_PPAUONTR_THRESH(config->pauseOnThr);
        handle->hw.base->PPAUOFFTR = NETC_ENETC_PPAUOFFTR_THRESH(config->pauseOffThr);
        /* Transmit priority to traffic class mapping, only do PSI */
        handle->hw.base->PRIO2TCMR0 = NETC_ENETC_PRIO2TCMR0_PRIO7TC(config->txPrioToTC[7]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO6TC(config->txPrioToTC[6]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO5TC(config->txPrioToTC[5]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO4TC(config->txPrioToTC[4]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO3TC(config->txPrioToTC[3]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO2TC(config->txPrioToTC[2]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO1TC(config->txPrioToTC[1]) |
                                      NETC_ENETC_PRIO2TCMR0_PRIO0TC(config->txPrioToTC[0]);
        /* Configure ENETC L3/L4 parser, only do on PSI */
        NETC_EnetcSetParser(handle->hw.base, &config->parserCfg);
        /* Configure ENETC PORT native VLAN, only do on PSI */
        NETC_EnetcPortSetNativeVLAN(handle->hw.base, &config->rxOuterVLANCfg, true);
        NETC_EnetcPortSetNativeVLAN(handle->hw.base, &config->rxInnerVLANCfg, false);

#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051524) && FSL_FEATURE_NETC_HAS_ERRATA_051524
        /* ERRATA051524: The Ingress Stream Identification key construction check of payload may evaluate incorrectly
           (indicating an invalid key construction) when the frame is received from a pseudo port (internal port) bound
           to ENETC or the switch, and maximum frame size is 1024 bytes or larger. */
        if ((config->port.ethMac.rxMaxFrameSize >= 1024U) && NETC_PortIsPseudo(handle->hw.portGroup.port))
        {
            /* Check the first payload is enough. */
            if (config->psfpCfg.kcRule[0].payload[0].pfp == 1U)
            {
                return kStatus_InvalidArgument;
            }
        }
#endif
        /* Configure ENETC PSFP, only do PSI */
        (void)EP_RxPSFPInit(handle, &config->psfpCfg);
        /* Configure ENETC traffic class, only do PSI */
        for (uint32_t i = 8U; i > 0U; i--)
        {
            result = EP_TxTrafficClassConfig(handle, (netc_hw_tc_idx_t)(uint32_t)(i - 1U), &config->txTcCfg[(i - 1U)]);
            if (result != kStatus_Success)
            {
                return result;
            }
        }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051246) && FSL_FEATURE_NETC_HAS_ERRATA_051246)
        /* Clear Tx/Rx disable to allow traffic to flow */
        handle->hw.portGroup.port->POR &= ~(NETC_PORT_POR_TXDIS_MASK | NETC_PORT_POR_RXDIS_MASK);
#else
        if (NETC_PortIsPseudo(handle->hw.portGroup.port))
        {
            if (0U != (SWITCH_PCI_HDR_TYPE0->PCI_CFH_CMD & ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK))
            {
                swPseudoPort->POR = porTemp;
            }
        }
#endif
    }

