tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
                if (isExtEnable && (0U != (txDesc[1].ext.eFlags & (uint32_t)kNETC_TxExtTwoStepTs)))
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTsAvail = true;
                }
                else
                {
                    txBdRing->dirtyBase[txBdRing->producerIndex].isTsAvail = false;
                }
                /* Copy user Tx descriptors to hardware Tx BD. */
                txDesTemp->standard.flags  = txDesc[0].standard.flags;
                txDesTemp->standard.addr   = address;
                txDesTemp->standard.bufLen = txBuff->length;
#if defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG
                txDesc[1].ext.frameLenExt    = (frameLen >> 16U) & 0x7U;
                txDesTemp->standard.frameLen = frameLen & 0xFFFFU;
#else
                txDesTemp->standard.frameLen = frameLen;
#endif
                txDesTemp->standard.isExtended = (uint32_t)isExtEnable;
                txDesTemp->standard.enableInterrupt =
                    (uint32_t)((handle->hw.si->BDR[hwRing].TBIER & ENETC_SI_TBIER_TXFIE_MASK) != 0U);

                if (isExtEnable)
                {
                    /* Increase producer index when first BD is extension BD. */
                    txBdRing->producerIndex = EP_IncreaseIndex(txBdRing->producerIndex, txBdRing->len);
                    txDesTemp               = &txBdRing->bdBase[txBdRing->producerIndex];
                    NETC_CopyTxDescriptor(txDesTemp, &txDesc[1]);
                    bdIndex++;
                }
            }
            else
            {
                txDesTemp->standard.addr   = address;
                txDesTemp->standard.bufLen = txBuff->length;
            }

            /* Increase tx buffer address index and producer index. */
            txBuff++;
            txBdRing->producerIndex = EP_IncreaseIndex(txBdRing->producerIndex, txBdRing->len);
        }

        /* Set final flag in last BD, same bit for stand or extension BD */
        if (txDesTemp != NULL)
        {
            txDesTemp->standard.isFinal = 1;
        }

        /* Make sure all data in the Tx BD is ready. */
        __DSB();

        /* Active Tx. */
        NETC_SISetTxProducer(handle->hw.si, hwRing, txBdRing->producerIndex);
    }

    return result;
}

status_t EP_SendFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, void *context, ep_tx_opt *opt)
{
    assert(handle != NULL);
    uint8_t hwRing = ring;
    netc_tx_bd_t txDesc[2];

    NETC_ClearTxDescriptor(&txDesc[0]);
    NETC_ClearTxDescriptor(&txDesc[1]);

    if (ring >= handle->cfg.txRingUse)
    {
        /* Tx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }

#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing += handle->ringShift;
    }
#endif

    if (opt != NULL)
    {
        if ((opt->flags & (uint32_t)kEP_TX_OPT_START_TIME) != 0U)
        {
            txDesc[0].standard.flags = NETC_SI_TXDESCRIP_RD_FL(0x2U) | NETC_SI_TXDESCRIP_RD_TSE_MASK |
                                       NETC_SI_TXDESCRIP_RD_TXSTART(opt->timestamp);
        }
#if defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG
        else
        {
            txDesc[0].standard.flags =
                NETC_SI_TXDESCRIP_RD_LSO(opt->offload.lso) | NETC_SI_TXDESCRIP_RD_L4CS(opt->offload.l4Checksum) |
                NETC_SI_TXDESCRIP_RD_L4T(opt->offload.l4Type) | NETC_SI_TXDESCRIP_RD_L3T(opt->offload.l3Type) |
                NETC_SI_TXDESCRIP_RD_L3HDRSIZE(opt->offload.l3HeaderSize) |
                NETC_SI_TXDESCRIP_RD_IPCS(opt->offload.ipv4Checksum) |
                NETC_SI_TXDESCRIP_RD_L3START(opt->offload.l3Start);
        }
#endif

        if ((opt->flags & (uint32_t)kEP_TX_OPT_VLAN_INSERT) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.pcp             = opt->vlan.pcp;
            txDesc[1].ext.dei             = opt->vlan.dei;
            txDesc[1].ext.vid             = opt->vlan.vid;
            txDesc[1].ext.tpid            = (uint16_t)opt->vlan.tpid;
            txDesc[1].ext.eFlags          = (uint8_t)kNETC_TxExtVlanInsert;
        }
        if ((opt->flags & (uint32_t)kEP_TX_OPT_REQ_TS) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= (uint8_t)kNETC_TxExtTwoStepTs;
        }
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
        if ((opt->flags & (uint32_t)kEP_TX_OPT_REQ_ONE_STEP_TS) != 0U)
        {
            txDesc[0].standard.isExtended = 1U;
            txDesc[1].ext.eFlags |= (uint8_t)kNETC_TxExtOneStepTs;
        }
#endif
    }
    return EP_SendFrameCommon(handle, &handle->txBdRing[ring], hwRing, frame, context, &txDesc[0],
                              handle->cfg.txCacheMaintain);
}

netc_tx_frame_info_t *EP_ReclaimTxDescCommon(ep_handle_t *handle,
                                             netc_tx_bdr_t *txBdRing,
                                             uint8_t hwRing,
                                             bool enCallback)
{
    netc_tx_frame_info_t *frameInfo = NULL;
    netc_tx_bd_t *txDesc;
    uint16_t cleanNum;
    uint16_t consumer = NETC_SIGetTxConsumer(handle->hw.si, hwRing);

    /* Get the dirty Tx BD number ready for reclaiming in the ring */
    if (consumer >= txBdRing->cleanIndex)
    {
        cleanNum = (consumer - txBdRing->cleanIndex);
    }
    else
    {
        cleanNum = (uint16_t)(txBdRing->len - txBdRing->cleanIndex + consumer);
    }

    while (cleanNum-- != 0U)
    {
        /* When callback enable, get the reclaim information. */
        if (enCallback)
        {
            txDesc = &txBdRing->bdBase[txBdRing->cleanIndex];

            /* Valid Tx frame information is in the first BD of one BD chain. */
            if (txDesc->writeback.written != 0U)
            {
                /* When reclaim callback is enabled, never process more than one full frame */
                if (NULL != frameInfo)
                {
                    break;
                }

                frameInfo = &txBdRing->dirtyBase[txBdRing->cleanIndex];
                if (frameInfo->isTsAvail)
                {
                    frameInfo->timestamp = txDesc->writeback.timestamp;
                } else {
                    frameInfo->timestamp = 0;
                }
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
                if (frameInfo->isTxTsIdAvail)
                {
                    frameInfo->txtsid = (uint16_t)txDesc->writeback.txtsid;
                } else {
                    frameInfo->txtsid = 0;
                }
#endif
                frameInfo->status = (netc_ep_tx_status_t)txDesc->writeback.status;
            }
            else if (txDesc->standard.frameLen != 0U)
            {
                /* When reclaim callback is enabled, never process more than one full frame */
                if (NULL != frameInfo)
                {
                    break;
                }

