tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
                frameInfo         = &txBdRing->dirtyBase[txBdRing->cleanIndex];
                frameInfo->status = kNETC_EPTxSuccess;
            }
            else
            {
                /* Intentional empty */
            }
        }

        /* Update the clean index to free BD resource. */
        txBdRing->cleanIndex = EP_IncreaseIndex(txBdRing->cleanIndex, txBdRing->len);

        if (cleanNum == 0U)
        {
            consumer = NETC_SIGetTxConsumer(handle->hw.si, hwRing);
            /* Get the dirty Tx BD number again */
            if (consumer >= txBdRing->cleanIndex)
            {
                cleanNum = (consumer - txBdRing->cleanIndex);
            }
            else
            {
                cleanNum = (uint16_t)(txBdRing->len - txBdRing->cleanIndex + consumer);
            }
        }
    }
    return frameInfo;
}

void EP_ReclaimTxDescriptor(ep_handle_t *handle, uint8_t ring)
{
    assert(ring < handle->cfg.txRingUse);
    netc_tx_frame_info_t *frameInfo;
    uint8_t hwRing = ring;

#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing += handle->ringShift;
    }
#endif

    do
    {
        frameInfo =
            EP_ReclaimTxDescCommon(handle, &handle->txBdRing[ring], hwRing, (handle->cfg.reclaimCallback != NULL));
        /* If reclaim callback is enabled, it must be called for each full frame. */
        if (frameInfo != NULL)
        {
            (void)handle->cfg.reclaimCallback(handle, ring, frameInfo, handle->cfg.userData);
        }
    } while (frameInfo != NULL);
}

status_t EP_GetRxFrameSizeCommon(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint32_t *length)
{
    status_t result      = kStatus_NETC_RxHRZeroFrame;
    netc_rx_bd_t *rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    uint16_t index       = rxBdRing->index;
    uint32_t totlen      = 0;

    /* Reset the length to zero. */
    *length = 0;

    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if (rxDesc->writeback.isReady == 0U)
    {
        result = kStatus_NETC_RxFrameEmpty;
    }
    else
    {
        /* Check the status of the received frame. */
        if (rxDesc->writeback.error != 0U)
        {
            result = kStatus_NETC_RxFrameError;
        }
        else if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_TimestampResp)
        {
            if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_RegularFrame)
            {
                result = kStatus_NETC_RxHRNotZeroFrame;
            }
            else
            {
                result = kStatus_NETC_RxHRZeroFrame;
            }
            do
            {
                /* Check abnormal case. */
                if (rxDesc->writeback.bufLen == 0U)
                {
                    result = kStatus_NETC_RxFrameError;
                    break;
                }
                totlen += rxDesc->writeback.bufLen;

                /* Find the last buffer descriptor. */
                if (rxDesc->writeback.isFinal != 0U)
                {
                    *length = totlen;
                    break;
                }

                /* Extended BD needs additional offset. */
                if (rxBdRing->extendDesc)
                {
                    index = EP_IncreaseIndex(index, rxBdRing->len);
                }

                /* Increase to next buffer descriptor. */
                index  = EP_IncreaseIndex(index, rxBdRing->len);
                rxDesc = &rxBdRing->bdBase[index];
            } while (index != rxBdRing->index);
        }
        else
        {
            /* Get Transmit Timestamp Reference Response messages */
            *length = rxDesc->writeback.bufLen;
            result = kStatus_NETC_RxTsrResp;
        }
    }
    return result;
}

status_t EP_GetRxFrameSize(ep_handle_t *handle, uint8_t ring, uint32_t *length)
{
    assert((handle != NULL) && (length != NULL));
    status_t result;
    if (ring >= handle->cfg.rxRingUse)
    {
        /* Rx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }
    else
    {
        result = EP_GetRxFrameSizeCommon(handle, &handle->rxBdRing[ring], length);
        if (kStatus_NETC_RxHRZeroFrame == result)
        {
            /* Only return success when currently frame is regular frame */
            result = kStatus_Success;
        }
        return result;
    }
}

static void EP_GetRxFrameAttribute(ep_handle_t *handle, netc_rx_bd_t *rxDesc, netc_frame_attr_t *attr)
{
    bool isPseudoPort = NETC_PortIsPseudo(handle->hw.portGroup.port);

    (void)memset(attr, 0, sizeof(netc_frame_attr_t));

    attr->parserSummary = rxDesc->writeback.parserSummary;
    attr->hostReason    = (netc_host_reason_t)rxDesc->writeback.hr;

    if (isPseudoPort)
    {
        attr->srcPort = (uint8_t)rxDesc->writeback.srcPort;
    }
    if ((rxDesc->writeback.flags & (uint8_t)kEP_RX_RSS_VALID) != 0U)
    {
        attr->isRssHashValid = true;
        attr->rssHash        = isPseudoPort ? rxDesc->writeback.rssHash : rxDesc->writeback.rssHashSwt;
    }
    if ((rxDesc->writeback.flags & (uint8_t)kEP_RX_VLAN_VALID) != 0U)
    {
        attr->isVlanExtracted = true;
        attr->vlan.vid        = rxDesc->writeback.vid;
        attr->vlan.dei        = rxDesc->writeback.dei;
        attr->vlan.pcp        = rxDesc->writeback.pcp;
        attr->vlan.tpid       = rxDesc->writeback.tpid;
    }
    if ((rxDesc->writeback.flags & (uint8_t)kEP_RX_TIMESTAMP_VALID) != 0U)
    {
        attr->isTsAvail = true;
    }
}

void EP_DropFrame(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint8_t ring)
{
    netc_rx_bd_t *rxDesc;
    uint64_t rxDmaBuff;
    uint16_t index;
    bool isLastBd;

    /* Drop frame through updating BD status. */
    do
    {
        rxDesc    = &rxBdRing->bdBase[rxBdRing->index];
        index     = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
        rxDmaBuff = rxBdRing->buffArray[index];
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        rxDmaBuff = (uint64_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)rxDmaBuff, kMEMORY_Local2DMA);
#endif
        rxDesc->standard.addr = rxDmaBuff;

