tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
        /* Store last BD flag before it's cleared. */
        isLastBd = (rxDesc->writeback.isFinal != 0U) ? true : false;

        /* Update the receive buffer descriptors. */
        rxDesc->writeback.isFinal = 0;
        rxDesc->writeback.isReady = 0;

        if (rxBdRing->extendDesc)
        {
            /* Skip 16-bytes extended BD space. */
            rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
        }
        rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
    } while (!isLastBd);

    /* Update the Rx consumer index to free idle BD. */
    index = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
    NETC_SISetRxConsumer(handle->hw.si, ring, index);
}

status_t EP_ReceiveFrameCopyCommon(ep_handle_t *handle,
                                   netc_rx_bdr_t *rxBdRing,
                                   uint8_t ring,
                                   void *buffer,
                                   uint32_t length,
                                   netc_frame_attr_t *attr,
                                   bool rxCacheMaintain)
{
    uint32_t leftLen = length;
    bool isTsBd      = true;
    uintptr_t offset = 0;
    netc_rx_bd_t *rxDesc;
    uint64_t rxDmaBuff;
    uint16_t copyLen;
    uintptr_t data;
    uint16_t index;
    bool isLastBd;

    /* For data-NULL input, drop the frame. */
    if (buffer == NULL)
    {
        EP_DropFrame(handle, rxBdRing, ring);
    }
    else
    {
        rxDesc = &rxBdRing->bdBase[rxBdRing->index];

        /* Get the Rx frame information from first BD. */
        if (attr != NULL)
        {
            EP_GetRxFrameAttribute(handle, rxDesc, attr);
        }

        do
        {
            /* Copy scattered buffers to contiguous application memory. */
            if (leftLen != 0U)
            {
                /* Get the destination buffer address which NETC DMA copy frames to. */
                rxDmaBuff = rxBdRing->extendDesc ? rxBdRing->buffArray[rxBdRing->index / 2U] :
                                                   rxBdRing->buffArray[rxBdRing->index];
                if (rxCacheMaintain)
                {
                    /* Invalidate cache before copy. */
                    NETC_DcacheInvalidateByRange((uintptr_t)rxDmaBuff, rxBdRing->buffSize);
                }

                data    = (uintptr_t)(uint8_t *)buffer + offset;
                copyLen = (leftLen > rxDesc->writeback.bufLen) ? rxDesc->writeback.bufLen : (uint16_t)leftLen;
                (void)memcpy((void *)(uint8_t *)data, (void *)(uint8_t *)(uintptr_t)rxDmaBuff, copyLen);
                offset += copyLen;
                leftLen -= copyLen;
            }

            /* Set the Rx buffer address in BD which is overwritten by BD writeback. */
            index     = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
            rxDmaBuff = rxBdRing->buffArray[index];
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            rxDmaBuff = (uintptr_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)rxDmaBuff, kMEMORY_Local2DMA);
#endif
            rxDesc->standard.addr = rxDmaBuff;

            /* The last buffer descriptor flag of one frame. */
            isLastBd = (rxDesc->writeback.isFinal != 0U) ? true : false;

            /* Updates the receive buffer descriptors. */
            rxDesc->writeback.isFinal = 0;
            rxDesc->writeback.isReady = 0;

            if (rxBdRing->extendDesc)
            {
                /* Extended BD occupies one more 16 bytes space. */
                rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);

                /* Get the timestamp from extended BD if it's valid. */
                if ((attr != NULL) && isTsBd && attr->isTsAvail)
                {
                    /* Only first extended BD takes timestamp. */
                    rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
                    attr->timestamp = rxDesc->ext.timestamp;
                    isTsBd          = false;
                }
            }

            /* Get the latest buffer descriptor. */
            rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
            rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
        } while (!isLastBd);

        /* Update the Rx consumer index to free BD whose data is taken away. */
        index = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
        NETC_SISetRxConsumer(handle->hw.si, ring, index);
    }

    return kStatus_Success;
}

status_t EP_ReceiveFrameCopy(ep_handle_t *handle, uint8_t ring, void *buffer, uint32_t length, netc_frame_attr_t *attr)
{
    assert((handle != NULL) && (((buffer != NULL) && (length != 0U)) || (buffer == NULL)));
    if (ring >= handle->cfg.rxRingUse)
    {
        /* Rx BD ring index is out of range */
        return kStatus_InvalidArgument;
    }
    else
    {
        return EP_ReceiveFrameCopyCommon(handle, &handle->rxBdRing[ring], ring, buffer, length, attr,
                                         handle->cfg.rxCacheMaintain);
    }
}

status_t EP_ReceiveFrameCommon(ep_handle_t *handle,
                               netc_rx_bdr_t *rxBdRing,
                               uint8_t ring,
                               netc_frame_struct_t *frame,
                               netc_frame_attr_t *attr,
                               bool rxCacheMaintain)
{
    status_t result      = kStatus_Success;
    netc_rx_bd_t *rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    bool isTsBd          = true;
    uint64_t rxDmaBuff;
    uint16_t buffIdx;
    uint16_t index;
    void *newBuff;
    bool isLastBd;

    /* Get the Rx frame information from first BD */
    rxDesc = &rxBdRing->bdBase[rxBdRing->index];
    if (attr != NULL)
    {
        EP_GetRxFrameAttribute(handle, rxDesc, attr);
    }

    index = 0;
    do
    {
        buffIdx = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;

        /* Get the destination buffer address which NETC DMA copy frames to. */
        rxDmaBuff = rxBdRing->buffArray[buffIdx];

