tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
        if (rxCacheMaintain)
        {
            NETC_DcacheInvalidateByRange((uintptr_t)rxDmaBuff, rxBdRing->buffSize);
        }

        newBuff                        = frame->buffArray[index].buffer;
        frame->buffArray[index].buffer = (void *)(uint8_t *)(uintptr_t)rxDmaBuff;
        frame->buffArray[index].length = rxDesc->writeback.bufLen;
        index++;

        /* Update the buffer address array. */
        rxBdRing->buffArray[buffIdx] = (uint64_t)(uintptr_t)(uint8_t *)newBuff;

        rxDmaBuff = (uint64_t)(uintptr_t)(uint8_t *)newBuff;
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
        rxDmaBuff = (uint64_t)MEMORY_ConvertMemoryMapAddress((uintptr_t)rxDmaBuff, kMEMORY_Local2DMA);
#endif
        rxDesc->standard.addr = rxDmaBuff;

        /* The last buffer descriptor of one frame. */
        isLastBd = (rxDesc->writeback.isFinal != 0U) ? true : false;

        /* Updates the receive buffer descriptors. */
        rxDesc->writeback.isFinal = 0;
        rxDesc->writeback.isReady = 0;

        if (rxBdRing->extendDesc)
        {
            /* Extended BD occupies one more 16 bytes space. */
            rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);

            /* Get the timestamp from extended BD if it's valid. */
            if ((attr != NULL) && isTsBd && attr->isTsAvail)
            {
                /* Only first extended BD takes timestamp. */
                rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
                attr->timestamp = rxDesc->ext.timestamp;
                isTsBd          = false;
            }
        }

        /* Get the latest buffer descriptor. */
        rxBdRing->index = EP_IncreaseIndex(rxBdRing->index, rxBdRing->len);
        rxDesc          = &rxBdRing->bdBase[rxBdRing->index];
    } while (!isLastBd);

    /* Get the Rx buffer array length. */
    frame->length = index;

    /* Update the Rx consumer index to free idle BD */
    index = rxBdRing->extendDesc ? (rxBdRing->index / 2U) : rxBdRing->index;
    NETC_SISetRxConsumer(handle->hw.si, ring, index);

    return result;
}

status_t EP_ReceiveFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, netc_frame_attr_t *attr)
{
    assert((handle != NULL) && (frame != NULL) && (handle->cfg.rxZeroCopy));

    status_t result         = kStatus_Success;
    netc_rx_bdr_t *rxBdRing = NULL;
    netc_rx_bd_t *rxDesc    = NULL;
    uint32_t buffNum        = 0;
    uint16_t index;
    void *newBuff;

    if (ring >= handle->cfg.rxRingUse)
    {
        /* Rx BD ring index is out of range. */
        return kStatus_InvalidArgument;
    }
    rxBdRing = &handle->rxBdRing[ring];
    rxDesc   = &rxBdRing->bdBase[rxBdRing->index];

    /* Check the current buffer descriptor's ready flag. The flag in first BD indicates entire frame ready status. */
    if (rxDesc->writeback.isReady == 0U)
    {
        /* Reset the buffer array length. */
        frame->length = 0;
        return kStatus_NETC_RxFrameEmpty;
    }
    else
    {
        /* Check the status of the received frame. */
        if (rxDesc->writeback.error != 0U)
        {
            result = kStatus_NETC_RxFrameError;
        }
        else if ((netc_host_reason_t)rxDesc->writeback.hr == kNETC_TimestampResp)
        {
            /* Get Transmit Timestamp Reference Response messages, use special API to receive this information. */
            return kStatus_NETC_RxTsrResp;
        }
        else
        {
            if ((netc_host_reason_t)rxDesc->writeback.hr != kNETC_RegularFrame)
            {
                /* Return without receive when currently frame is not regular frame */
                return kStatus_NETC_RxHRNotZeroFrame;
            }
            /* Check how many buffers will be taken away to receive one frame. */
            index = rxBdRing->index;
            do
            {
                buffNum++;

                /* Find the last BD of this frame. */
                if (rxDesc->writeback.isFinal != 0U)
                {
                    break;
                }

                if (rxBdRing->extendDesc)
                {
                    /* Extended BD needs additional offset. */
                    index = EP_IncreaseIndex(index, rxBdRing->len);
                }
                index  = EP_IncreaseIndex(index, rxBdRing->len);
                rxDesc = &rxBdRing->bdBase[index];
            } while (index != rxBdRing->index);

            /* The buffer array length provided by application is not enough to receive frame. */
            if (buffNum > frame->length)
            {
                return kStatus_NETC_LackOfResource;
            }

            /* Prepare the buffer from appliction to exchange with the buffer in the BD. */
            index = 0;
            do
            {
                newBuff = handle->cfg.rxBuffAlloc(handle, ring, rxBdRing->buffSize, handle->cfg.userData);
                if (newBuff == NULL)
                {
                    while (index-- > 0U)
                    {
                        handle->cfg.rxBuffFree(handle, ring, frame->buffArray[index].buffer, handle->cfg.userData);
                    }
                    /* When appliction buffer pool is not enough, drop frame in the BD to keep frame latest. */
                    result = kStatus_NETC_LackOfResource;
                    break;
                }

                /* Store in this strcuture, and exchange the buffer in the BD in below code. */
                frame->buffArray[index].buffer = newBuff;
                index++;
            } while (--buffNum != 0U);
        }
    }

    if (result != kStatus_Success)
    {
        frame->length = 0;
        EP_DropFrame(handle, rxBdRing, ring);
        return result;
    }

    return EP_ReceiveFrameCommon(handle, rxBdRing, ring, frame, attr, handle->cfg.rxCacheMaintain);
}

status_t EP_CmdBDRInit(ep_handle_t *handle, const netc_cmd_bdr_config_t *config)
{
    assert(handle != NULL);

