tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
status_t EP_RxPSFPAddRPTableEntry(ep_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_AddEntry);
}

status_t EP_RxPSFPUpdateRPTableEntry(ep_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_UpdateEntry);
}

status_t EP_RxPSFPAddOrUpdateRPTableEntry(ep_handle_t *handle, netc_tb_rp_config_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_AddOrUpdateRPTableEntry(&cdbrHandle, config, kNETC_AddOrUpdateEntry);
}

status_t EP_RxPSFPDelRPTableEntry(ep_handle_t *handle, uint32_t entryID)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_DelRPTableEntry(&cdbrHandle, entryID);
}

status_t EP_RxPSFPGetRPStatistic(ep_handle_t *handle, uint32_t entryID, netc_tb_rp_stse_t *statis)
{
    assert(handle != NULL);
    netc_cbdr_handle_t cdbrHandle;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;
    return NETC_GetRPStatistic(&cdbrHandle, entryID, statis);
}

status_t EP_MsixSetGlobalMask(ep_handle_t *handle, bool mask)
{
    if (getSiNum(handle->cfg.si) == 0U)
    {
        if (mask)
        {
            handle->hw.func.pf->PCI_CFC_MSIX_MSG_CTL |= (uint16_t)ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
        }
        else
        {
            handle->hw.func.pf->PCI_CFC_MSIX_MSG_CTL &=
                (uint16_t)(~ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK);
        }
    }
    else
    {
        if (mask)
        {
            handle->hw.func.vf->PCI_CFC_MSIX_MSG_CTL |=
                (uint16_t)ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK;
        }
        else
        {
            handle->hw.func.vf->PCI_CFC_MSIX_MSG_CTL &=
                (uint16_t)(~ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_FUNC_MASK_MASK);
        }
    }

    return kStatus_Success;
}

status_t EP_MsixSetEntryMask(ep_handle_t *handle, uint8_t entryIdx, bool mask)
{
    status_t result;

    if (entryIdx < handle->cfg.entryNum)
    {
        handle->hw.msixTable[entryIdx].control = (uint32_t)mask;
        result                                 = kStatus_Success;
    }
    else
    {
        result = kStatus_Fail;
    }

    return result;
}

status_t EP_MsixGetPendingStatus(ep_handle_t *handle, uint8_t pbaIdx, uint64_t *status)
{
    status_t result = kStatus_Success;
    bool funcEnable;

    if (handle->cfg.entryNum == 0U)
    {
        return kStatus_Fail;
    }

    /* Check MSIX enable status. */
    if (getSiNum(handle->cfg.si) == 0U)
    {
        funcEnable =
            ((handle->hw.func.pf->PCI_CFC_MSIX_MSG_CTL & ENETC_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK) != 0U);
    }
    else
    {
        funcEnable =
            ((handle->hw.func.vf->PCI_CFC_MSIX_MSG_CTL & ENETC_VF_PCI_TYPE0_PCI_CFC_MSIX_MSG_CTL_MSIX_EN_MASK) != 0U);
    }

    if (funcEnable)
    {
        if (pbaIdx <= ((handle->cfg.entryNum - 1U) / 64U))
        {
            *status = *(uint64_t *)((uintptr_t)handle->hw.msixTable + NETC_MSIX_TABLE_PBA_OFFSET + 8U * pbaIdx);
            result  = kStatus_Success;
        }
        else
        {
            result = kStatus_InvalidArgument;
        }
    }
    else
    {
        *status = 0;
        result  = kStatus_Fail;
    }

    return result;
}

status_t EP_RxL2MFInit(ep_handle_t *handle, netc_si_l2mf_config_t *config)
{
    uint8_t siNum = getSiNum(handle->cfg.si);

    NETC_EnetcEnablePromiscuous(handle->hw.base, siNum, config->macUCPromis, config->macMCPromis);
    NETC_SIEnablePromisc(handle->hw.si, kNETC_PacketUnicast, config->rejectUC);
    NETC_SIEnablePromisc(handle->hw.si, kNETC_PacketMulticast, config->rejectMC);
    NETC_SIEnablePromisc(handle->hw.si, kNETC_PacketBroadcast, config->rejectBC);

    return kStatus_Success;
}

status_t EP_RxL2MFAddHashEntry(ep_handle_t *handle, netc_packet_type_t type, uint8_t *macAddr)
{
    assert(type != kNETC_PacketBroadcast);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hashIndex = 0;
    uint64_t mac      = 0;
    int i             = 0;

    /* Calculate the hash index. */
    for (i = 5; i >= 0; i--)
    {
        mac = (mac << 8U) | macAddr[i];
    }
    for (i = 0; i < 8; i++)
    {
        hashIndex ^= (uint8_t)(mac & 0x3FU);
        mac = mac >> 6U;
    }

    NETC_EnetcAddMacAddrHash(handle->hw.base, siNum, type, hashIndex);

    /* Added the used count of hash index. */
    if (type == kNETC_PacketUnicast)
    {
        handle->unicastHashCount[hashIndex]++;
    }
    else
    {
        handle->multicastHashCount[hashIndex]++;
    }

    return kStatus_Success;
}

status_t EP_RxL2MFDelHashEntry(ep_handle_t *handle, netc_packet_type_t type, uint8_t *macAddr)
{
    assert(type != kNETC_PacketBroadcast);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hashIndex = 0;
    uint64_t mac      = 0;
    int i             = 0;

    /* Calculate the hash index. */
    for (i = 5; i >= 0; i--)
    {
        mac = (mac << 8U) | macAddr[i];
    }
    for (i = 0; i < 8; i++)
    {
        hashIndex ^= (uint8_t)(mac & 0x3FU);
        mac = mac >> 6U;
    }

    if (type == kNETC_PacketUnicast)
    {
        if (handle->unicastHashCount[hashIndex] == 0U)
        {
            return kStatus_Fail;
        }
        else
        {
            /* Delete the hash index when there's no address using this index. */
            if (--handle->unicastHashCount[hashIndex] == 0U)
            {
                NETC_EnetcDelMacAddrHash(handle->hw.base, siNum, type, hashIndex);
            }
        }
    }
    else
    {
        if (handle->multicastHashCount[hashIndex] == 0U)
        {
            return kStatus_Fail;
        }
        else
        {
            /* Delete the hash index when there's no other MAC address using this hash index. */
            if (--handle->multicastHashCount[hashIndex] == 0U)
            {
                NETC_EnetcDelMacAddrHash(handle->hw.base, siNum, type, hashIndex);
            }
        }
    }

    return kStatus_Success;
}

status_t EP_RxL2MFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint8_t *macAddr)
{
    assert((handle != NULL) && ((macAddr != NULL)));
    uint64_t address =
        ((uint64_t)macAddr[4] << 32U) + ((uint64_t)macAddr[5] << 40U) + *(uint32_t *)(uintptr_t)&macAddr[0];
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = address;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = (uint32_t)1U << getSiNum(handle->cfg.si);
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 1;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

status_t EP_RxL2MFDelEMTableEntry(ep_handle_t *handle, uint32_t idx)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = 0;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = 0;
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 1;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

