tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
status_t EP_RxL2VFInit(ep_handle_t *handle, netc_si_l2vf_config_t *config)
{
    NETC_EnetcConfigureVlanFilter(handle->hw.base, getSiNum(handle->cfg.si), config);
    return kStatus_Success;
}

status_t EP_RxL2VFAddHashEntry(ep_handle_t *handle, uint16_t vlanId)
{
    assert(handle != NULL);
    assert(vlanId <= 0xFFFU);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hash0     = (uint8_t)((vlanId >> 6U) & 0x3FU);
    uint8_t hash1     = (uint8_t)(vlanId & 0x3FU);
    uint8_t hashIndex = hash0 ^ hash1;

    NETC_EnetcAddVlanHash(handle->hw.base, siNum, hashIndex);

    /* Added the used count of hash index. */
    handle->vlanHashCount[hashIndex]++;

    return kStatus_Success;
}

status_t EP_RxL2VFDelHashEntry(ep_handle_t *handle, uint16_t vlanId)
{
    assert(handle != NULL);
    assert(vlanId <= 0xFFFU);

    uint8_t siNum     = getSiNum(handle->cfg.si);
    uint8_t hash0     = (uint8_t)((vlanId >> 6U) & 0x3FU);
    uint8_t hash1     = (uint8_t)(vlanId & 0x3FU);
    uint8_t hashIndex = hash0 ^ hash1;

    if (handle->vlanHashCount[hashIndex] == 0U)
    {
        return kStatus_Fail;
    }
    else
    {
        /* Delete the hash index when there's no other VLAN ID using this hash index. */
        if (--handle->vlanHashCount[hashIndex] == 0U)
        {
            NETC_EnetcDelVlanHash(handle->hw.base, siNum, hashIndex);
        }
    }

    return kStatus_Success;
}

status_t EP_RxL2VFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint16_t vlanId, netc_vlan_tpid_select_t tpid)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = (uint64_t)vlanId | ((uint64_t)tpid << 16U);
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = (uint32_t)1U << getSiNum(handle->cfg.si);
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 2;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

status_t EP_RxL2VFDelEMTableEntry(ep_handle_t *handle, uint32_t idx)
{
    assert(handle != NULL);
    netc_cmd_bd_t cmdBd = {0};

    /* Only PSI can access MAC filter table */
    if (getSiNum(handle->cfg.si) != 0U)
    {
        return kStatus_InvalidArgument;
    }
    cmdBd.generic.addr     = 0;
    cmdBd.generic.en       = 1;
    cmdBd.generic.siBitMap = 0;
    cmdBd.generic.index    = idx;
    cmdBd.generic.cmd      = 0;
    cmdBd.generic.class    = 2;
    cmdBd.generic.ci       = 0;
    cmdBd.generic.sf       = 1;
    return NETC_CmdBDSendCommand((netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR, &handle->cmdBdRing, &cmdBd,
                                 kNETC_NtmpV1_0);
}

#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable, uint8_t gateState)
#else
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable)
#endif
{
    assert(handle != NULL);
    status_t result = kStatus_Success;

    if (enable)
    {
        handle->hw.portGroup.port->PTGSCR |= NETC_PORT_PTGSCR_TGE_MASK;
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
        netc_tgs_gate_entry_t gate[2] = {{.interval = 50000U, .tcGateState = gateState},
                                         {.interval = 50000U, .tcGateState = gateState}};
        netc_tb_tgs_gcl_t wTgsList    = {.cycleTime = 1000000U, .numEntries = 2U, .gcList = &gate[0]};
        uint64_t time;
        /* Enable master bus and memory access for default ns timer*/
        TMR_PCI_HDR_TYPE0->PCI_CFH_CMD |=
            (ENETC_PCI_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK | ENETC_PCI_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK);

        NETC_TimerGetTime(TMR0_BASE, &time);

        wTgsList.baseTime = time;
        result            = EP_TxTGSConfigAdminGcl(handle, &wTgsList);
#endif
    }
    else
    {
        handle->hw.portGroup.port->PTGSCR &= ~NETC_PORT_PTGSCR_TGE_MASK;
    }

    return result;
}

status_t EP_TxTGSConfigAdminGcl(ep_handle_t *handle, netc_tb_tgs_gcl_t *config)
{
    assert((handle != NULL) && (config != NULL));
    netc_cbdr_handle_t cdbrHandle;
    status_t status = kStatus_Success;

    cdbrHandle.base   = (netc_cbdr_hw_t *)(uintptr_t)&handle->hw.si->SICBDRMR;
    cdbrHandle.cmdr   = &handle->cmdBdRing;
    cdbrHandle.buffer = &s_cmdData;

    if (0U != (handle->hw.portGroup.port->PTGAGLSR & NETC_PORT_PTGAGLSR_CFG_PEND_MASK))
    {
        /* Removed the previous pending administrative gate control list */
        netc_tb_tgs_gcl_t emptyList = {.entryID = config->entryID, .numEntries = 0U};
        status                      = NETC_ConfigTGSAdminList(&cdbrHandle, &emptyList);

        if (kStatus_Success != status)
        {
            return status;
        }
    }
#if defined(FSL_FEATURE_NETC_HAS_ERRATA_051587) && FSL_FEATURE_NETC_HAS_ERRATA_051587
    if (0U != (handle->hw.portGroup.port->PTGAGLSR & NETC_PORT_PTGAGLSR_TG_MASK))
    {
        netc_cmd_bd_t cmdBd = {0};
        uint32_t cycleTime;
        uint64_t time, minBaseTime;

        /* Read the previous active Operationa gate control list cycle time*/
        (void)memset(cdbrHandle.buffer, 0, sizeof(netc_tb_tgs_req_data_t));
        cdbrHandle.buffer->tgs.request.entryID                    = config->entryID;
        cdbrHandle.buffer->tgs.request.commonHeader.updateActions = 0U;
        cdbrHandle.buffer->tgs.request.commonHeader.queryActions  = 0U;
        cmdBd.req.addr                                            = (uintptr_t)cdbrHandle.buffer;
        cmdBd.req.reqLength                                       = 8U;
        /* Set Response Data Buffer length to MAX */
        cmdBd.req.resLength  = sizeof(netc_tb_tgs_data_t);
        cmdBd.req.tableId    = kNETC_TGSTable;
        cmdBd.req.cmd        = kNETC_QueryEntry;
        cmdBd.req.accessType = kNETC_EntryIDMatch;
        status               = NETC_CmdBDSendCommand(cdbrHandle.base, cdbrHandle.cmdr, &cmdBd, kNETC_NtmpV2_0);
        if (kStatus_Success == status)
        {
            cycleTime = ((netc_tb_tgs_olse_t *)(uintptr_t)(&((uint8_t *)cdbrHandle.buffer)[36U]))->operCycleTime;
        }
        else
        {
            return status;
        }
        /* Get Current Time */
        NETC_TimerGetTime(TMR0_BASE, &time);

