tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_endpoint.c
void EP_PsiClearStatus(ep_handle_t *handle, uint32_t mask)
{
    /* Check whether VSI number is over the capability. */
    assert(((uint16_t)mask >> handle->capability.vsiNum) <= 1U);
    assert(((uint16_t)(mask >> 16U) >> handle->capability.vsiNum) <= 1U);
    assert(handle->capability.vsiNum > 0U);
    assert(getSiNum(handle->cfg.si) == 0U);
    NETC_SIPsiClearStatus(handle->hw.si, mask);
}

status_t EP_PsiSendMsg(ep_handle_t *handle, uint16_t msg, netc_vsi_number_t vsi)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiSendMsg(handle->hw.si, msg, vsi);
}

bool EP_PsiCheckTxBusy(ep_handle_t *handle, netc_vsi_number_t vsi)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiCheckTxBusy(handle->hw.si, vsi);
}

status_t EP_PsiSetRxBuffer(ep_handle_t *handle, netc_vsi_number_t vsi, uint64_t buffAddr)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiSetRxBuffer(handle->hw.si, vsi, buffAddr);
}

status_t EP_PsiGetRxMsg(ep_handle_t *handle, netc_vsi_number_t vsi, netc_psi_rx_msg_t *msgInfo)
{
    assert(handle->capability.vsiNum > NETC_SIGetVsiIndex(vsi));
    assert(getSiNum(handle->cfg.si) == 0U);
    return NETC_SIPsiGetRxMsg(handle->hw.si, vsi, msgInfo);
}

void EP_VsiEnableInterrupt(ep_handle_t *handle, uint32_t mask, bool enable)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiEnableInterrupt(handle->hw.si, mask, enable);
}

uint32_t EP_VsiGetStatus(ep_handle_t *handle)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiGetStatus(handle->hw.si);
}

void EP_VsiClearStatus(ep_handle_t *handle, uint32_t mask)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiClearStatus(handle->hw.si, mask);
}

status_t EP_VsiSendMsg(ep_handle_t *handle, uint64_t msgAddr, uint32_t msgLen)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiSendMsg(handle->hw.si, msgAddr, msgLen);
}

void EP_VsiCheckTxStatus(ep_handle_t *handle, netc_vsi_msg_tx_status_t *status)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    NETC_SIVsiCheckTxStatus(handle->hw.si, status);
}

status_t EP_VsiReceiveMsg(ep_handle_t *handle, uint16_t *msg)
{
    assert(getSiNum(handle->cfg.si) <= (uint8_t)handle->capability.vsiNum);
    assert(getSiNum(handle->cfg.si) != 0U);
    return NETC_SIVsiReceiveMsg(handle->hw.si, msg);
}
